## Setup libraries & SQL connection

In [49]:
import pandas as pd
import sqlalchemy

# Format of connection string is:
# mysql+pymysql://username:password@host:port/database_name
engine = sqlalchemy.create_engine('mysql+pymysql://root:Pass_123@localhost:3306/application')

## Read entire table in a dataframe using `read_sql_table`

In [50]:
df = pd.read_sql_table('customers', con = engine)
df

   id    name phone_number
0   1  Donald   7326784567
1   2    Bill   6573489999
2   3    Modi   4567895646

## Read only selected columns

In [51]:
df = pd.read_sql_table('customers', con = engine, columns = ['name', 'phone_number'])
df

     name phone_number
0  Donald   7326784567
1    Bill   6573489999
2    Modi   4567895646

## Join two tables and read them in a dataframe using `read_sql_query`

In [52]:
query = '''
SELECT c.name, c.phone_number, o.name, o.amount
FROM customers c JOIN orders o
ON c.id = o.customer_id
ORDER BY o.amount DESC
'''
df = pd.read_sql_query(query, con = engine)
df

     name phone_number          name  amount
0  Donald   7326784567  Google Pixel     950
1    Modi   4567895646  Fossil Watch     120
2    Bill   6573489999      Yoga Mat      20

## `read_sql:`
- It is a wrapper around read_sql_query and read_sql_table
- We can perform both of these using `read_sql`

In [53]:
pd.read_sql("orders", engine)

   customer_id          name  amount
0            1  Google Pixel     950
1            2      Yoga Mat      20
2            3  Fossil Watch     120

In [54]:
query = '''
SELECT * FROM orders
'''
pd.read_sql(query, engine)

   customer_id          name  amount
0            1  Google Pixel     950
1            2      Yoga Mat      20
2            3  Fossil Watch     120

## Sample DataFrame

In [55]:
import pandas as pd

data = [[4, 'rafael nadal', 4567895647],
    [5, 'maria sharapova', 434534545],
    [6, 'vladimir putin', 89345345],
    [7, 'kim un jong', 123434456],
    [8, 'jeff bezos', 934534543],
    [9, 'rahul gandhi', 44324222]
]

df = pd.DataFrame(data, columns=['id', 'name', 'phone_number'])
df

   id             name  phone_number
0   4     rafael nadal    4567895647
1   5  maria sharapova     434534545
2   6   vladimir putin      89345345
3   7      kim un jong     123434456
4   8       jeff bezos     934534543
5   9     rahul gandhi      44324222

## Write to mysql database using `to_sql`

In [56]:
df.to_sql(name = 'customers', con = engine, if_exists = 'append', index = False)

6

In [57]:
pd.read_sql_table('customers', con = engine)

   id             name phone_number
0   1           Donald   7326784567
1   2             Bill   6573489999
2   3             Modi   4567895646
3   4     rafael nadal   4567895647
4   5  maria sharapova    434534545
5   6   vladimir putin     89345345
6   7      kim un jong    123434456
7   8       jeff bezos    934534543
8   9     rahul gandhi     44324222

### `to_sql` has different parameters such as `chunksize` which allows to write data in chunks. This is useful when size of dataframe is huge